{
  "add_cross_attention": false,
  "architectures": [
    "BertForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": null,
  "classifier_dropout": null,
  "directionality": "bidi",
  "dtype": "float32",
  "eos_token_id": null,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "B-COLOR",
    "1": "B-DIRECTION",
    "2": "B-DURATION_NUM",
    "3": "B-DURATION_UNIT",
    "4": "B-LOCATION",
    "5": "B-NOTE_TEXT",
    "6": "B-OBJECT",
    "7": "B-QUERY",
    "8": "B-TIME",
    "9": "B-VALUE",
    "10": "I-NOTE_TEXT",
    "11": "I-QUERY",
    "12": "I-TIME",
    "13": "O"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "is_decoder": false,
  "label2id": {
    "B-COLOR": 0,
    "B-DIRECTION": 1,
    "B-DURATION_NUM": 2,
    "B-DURATION_UNIT": 3,
    "B-LOCATION": 4,
    "B-NOTE_TEXT": 5,
    "B-OBJECT": 6,
    "B-QUERY": 7,
    "B-TIME": 8,
    "B-VALUE": 9,
    "I-NOTE_TEXT": 10,
    "I-QUERY": 11,
    "I-TIME": 12,
    "O": 13
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "output_past": true,
  "pad_token_id": 0,
  "pooler_fc_size": 768,
  "pooler_num_attention_heads": 12,
  "pooler_num_fc_layers": 3,
  "pooler_size_per_head": 128,
  "pooler_type": "first_token_transform",
  "tie_word_embeddings": true,
  "transformers_version": "5.3.0",
  "type_vocab_size": 2,
  "use_cache": false,
  "vocab_size": 119547
}
